import os
from dotenv import load_dotenv

load_dotenv()

# Токен беремо з .env, якщо його там немає - використовуємо ваш дефолтний
BOT_TOKEN = os.getenv("BOT_TOKEN", "8559331716:AAEbQ7X0LmBw0pQukl9Y0EZAj2qg0ywLlpE")

# Безпечне отримання нікнейму адміна
raw_admin_tg = os.getenv("ADMIN_TG")
if raw_admin_tg:
    # Якщо в .env нік вже з @, не додаємо її ще раз
    ADMIN_TG = raw_admin_tg if raw_admin_tg.startswith("@") else f"@{raw_admin_tg}"
else:
    ADMIN_TG = "@admin" # Значення за замовчуванням, щоб бот не падав

# ID адміна для сповіщень (додайте свій ID у .env як ADMIN_ID=12345678)
ADMIN_ID = os.getenv("ADMIN_ID")

STO_NAME = "СТО Автодонор"
ADDRESS = "вул. Ремонтна, 8, Угринів, Івано-Франківська область, 77423"
PHONE = "098 199 1246"

SCHEDULE = """
Понеділок: 09:00–18:00
Вівторок: 09:00–18:00
Середа: 09:00–18:00
Четвер: 09:00–18:00
П’ятниця: 09:00–18:00
Субота: Зачинено
Неділя: Зачинено
"""

SERVICES = [
    "Комп’ютерна діагностика",
    "Ремонт турбін",
    "Реставрація рульових рейок",
    "Реставрація форсунок 1.5 DCI",
    "Ремонт двигунів",
    "Ремонт ходової частини",
    "Вулканізація",
    "Кондиціонування",
    "Імпортні автозапчастини",
    "Паливні форсунки для дизельних авто",
    "Послуги евакуатора"
]

if not BOT_TOKEN:
    raise ValueError("❌ BOT_TOKEN не знайдено!")